Sure, these are the DNS resources in question:

```
data "opentelekomcloud_dns_zone_v2" "tld" {
  name = "${var.tld}."
}

resource "opentelekomcloud_dns_recordset_v2" "loadbalancer" {
  zone_id     = data.opentelekomcloud_dns_zone_v2.tld.id
  name        = "${var.environment}.${var.tld}."
  description = "A record for load balancer"
  ttl         = var.ttl
  type        = "A"
  records     = [var.loadbalancer_public_ip]
}

resource "opentelekomcloud_dns_recordset_v2" "loadbalancer_wildcard" {
  zone_id     = data.opentelekomcloud_dns_zone_v2.tld.id
  name        = "*.${var.environment}.${var.tld}."
  description = "Wildcard A record for load balancer"
  ttl         = var.ttl
  type        = "A"
  records     = [var.loadbalancer_public_ip]
}
```

which will lead to this plan fragments:

```

  # module.infrastructure.module.dns.data.opentelekomcloud_dns_zone_v2.tld will be read during apply
  # (config refers to values not yet known)
 <= data "opentelekomcloud_dns_zone_v2" "tld"  {
      + attributes     = (known after apply)
      + created_at     = (known after apply)
      + id             = (known after apply)
      + links          = (known after apply)
      + masters        = (known after apply)
      + name           = "example.com."
      + pool_id        = (known after apply)
      + project_id     = (known after apply)
      + serial         = (known after apply)
      + transferred_at = (known after apply)
      + updated_at     = (known after apply)
      + version        = (known after apply)
    }

  # module.infrastructure.module.dns.opentelekomcloud_dns_recordset_v2.loadbalancer will be created
  + resource "opentelekomcloud_dns_recordset_v2" "loadbalancer" {
      + description = "A record for load balancer"
      + id          = (known after apply)
      + name        = "varac.example.com."
      + records     = (known after apply)
      + region      = (known after apply)
      + shared      = false
      + ttl         = 300
      + type        = "A"
      + zone_id     = (known after apply)
    }

  # module.infrastructure.module.dns.opentelekomcloud_dns_recordset_v2.loadbalancer_wildcard will be created
  + resource "opentelekomcloud_dns_recordset_v2" "loadbalancer_wildcard" {
      + description = "Wildcard A record for load balancer"
      + id          = (known after apply)
      + name        = "*.varac.example.com."
      + records     = (known after apply)
      + region      = (known after apply)
      + shared      = false
      + ttl         = 300
      + type        = "A"
      + zone_id     = (known after apply)
}
```

Hope that helps, happy to provide more info if you need (would the state file after a `tf plan` help? ) in a private channel.